import Image from 'next/image'
import Author from "../assets/A-Otkur.jpg"
import {IoLogoTwitter} from "react-icons/io"
import {FaFacebook} from "react-icons/fa"
import {GrLinkedin} from "react-icons/gr"
import {HiOutlineLink} from "react-icons/hi"
import {BiBookmarks} from "react-icons/bi"
import {FiMoreHorizontal} from "react-icons/fi" 



function PostContent() {
  return (
    <>
      <div className='flex items-center justify-center flex-[3] w-screen border-l border-r'>
          <div className='h-screen w-full p-[2rem]'>
                <div className='flex items-center justify-between gap-5 mt-[2.2] mb-[1.2rem]'>
                  <div className='flex gap-3'>
                      <div className='overflow-hidden rounded-full grid center w-[3rem] h-[3rem]'>
                        <Image className={`object-cover`}
                        src={Author}
                        height={100}
                        width={100}/>
                      </div>
                      <div className='flex flex-col'>
                          <p className='font-alkatip_t pt-1'>ئابدۇرېھىم ئۆتكۈر</p>
                          <div className='flex gap-[.2rem] text-[#787878]'>
                              <span className='font-alkatip_t '>18- يانۋار <span> 5 مىنۇتتا ئوقۇڭ </span></span>
                          </div>
                      </div>
                  </div>
                  <div className='flex gap-3 text-[#787878]'>
                    <IoLogoTwitter className='w-5 h-5'/>              
                    <FaFacebook className='w-5 h-5' />
                    <GrLinkedin className='w-5 h-5'/>
                    <HiOutlineLink className='w-5 h-5'/>
                    <div className='w-[0.5rem]'/>
                    <BiBookmarks className='w-5 h-5'/>
                    <FiMoreHorizontal className='w-5 h-5'/>
                  </div>
                </div>
             <div>
          </div>

          <div className='flex flex-col'> 
          <div className='flex justify-center items-center h-[18rem] w-full overflow-hidden mb-[2rem]'>
            <Image className="object-cover" src={Author} height={400} />
          </div>   
                <h2 className='font-alkatip_tt text-center text-xl'>
                ئابدۇرېھىم ئۆتكۈر كىم؟
                </h2>
                <h4 className='font-alkatip_t text-lg text-[#292929]'>ئابدۇللا ئارىش،  18 - يانۋار  </h4>
                <p className='font-alkatip_t text-md'>قىسقىچە مەزمۇنى: ئابدۇرېھىم ئۆتكۈر ئاتاقلىق يازغۇچى، شائىر، ئۇنىڭ ئى ناملىق ئەسىرى ھەممىدىن داڭلىق.</p>
                <p className='font-alkatip_t'>  
                ئۇيغۇر بۇگۈنكى زامان ئەدەبىياتىنىڭ يارقىن نامايەندىلىرىدىن، يىرىك شائىر ۋە يازغۇچى مول نەتىجىلىرى بىلەن خەلقىمىزنىڭ كۆڭۈل تۆرىدىن ئورۇن ئېلىپ كېلىۋاتقان ئىستىداتلىق مەرھۇم ئەدەبىياتشۇناس ئالىم ئابدۇرېھىم ئۆتكۈر 1923- يىلى قۇمۇلدا ئوتتۇراھال تىجارەتچى ئائىلىسىدە دۇنياغا كەلگەن. ئۇ ئۆز ئاتا- ئانىسىدىن كىچىكىدىلا ئايرىلىپ، يېتىم قالغان. دادىسى تىلەش بېگىم ئارتۇش تىجەنلىك كىشى بولۇپ، ئالەمدىن ئۆتەر چېغىدا، ئەمدىلا تۆرت ياشقا كىرگەن ئابدۇرېھىمنى قۇمۇل مۆتىۋەرلىرىدىن بولغان دوستى ئوسمان ھاجىغا ئوغۇللۇققا بېرىۋەتكەن. ئوسمان ھاجىم كۆپنى كۆرگەن، ئوقۇمۇشلۇق، تەرەققىيپەرۋەر كىشى ئىدى. ئۇ ئۆمۈر بويى پەرزەنت يۈزى كۆرمىگەن بولغاچقا، ئابدۇرېھىمنى ئىنتايىن ئارزۇلاپ ۋە كۆڭۈل قويۇپ تەربىيىلىگەن. ئۇنى ئۆزى ئوقۇتۇپ خەت-ساۋادىنى چىقارغاندىن كېيىن، دىنىي مەكتەپكە بەرگەن. دىنىي مەكتەپتە دەرسلىك قىلىنغان كلاسسىك ئەسەرلەر ئىچىدە «سوڧى ئاللايار» دېگەن كىتاب تىلىنىڭ چۈشىنىشلىك، ئاممىباب، گۈزەل، تەسىرلىك بولۇشى ۋە ۋەزنىنىڭ جاراڭلىقلىقى بىلەن ئابدۇرېھىم ئۆتكۈرنى ئۆزىگە مەڧتۇن قىلىۋالغان. شۇنىڭ ئۈچۈن ئۇ ئىككى مىڭ مىسرادىن ئارتۇق شېئىردىن تۈزۈلگەن بۇ كىتابنىڭ كۆپ قىسمىنى يادىلاپ بولغان. 1934-يىلى گۈدەك ئابدۇرېھىم باشلانغۇچ مەكتەپتە پەننىي بىلىم ئېلىشقا مۇيەسسەر بولغان؛ 1936-يىلى ئۈرۈمچىگە ئوقۇشقا ئەۋەتىلىپ، ئۈرۈمچى بىرىنچى گىمنازىيىدە ئۈچ يىل ئوقۇغان؛ 1939- يىلى شىنجاڭ دارىلفۇنۇنىغا ئىمتىھان بېرىپ كىرگەن؛

1942- يىلى بۇ مەكتەپنىڭ پېداگوگىكا فاكۇلتېتىنى ئەلا نەتىجە بىلەن پۈتتۈرگەن. ئۇ بۇ مەزگىلدە «گاڭ قانات لاچىن»، «دولقۇنلۇق ھايات»، «يىڭى جۇڭگو گۈلىستانىغا»، «تامچە قاندىن مىليون چېچەكلەر»، «چىن مودەن» (ل.مۇتەللىپ بىلەن بىرلىشىپ يازغان) قاتارلىق شېئىر، داستان ۋە درامالارنى «شىنجاڭ گېزىتى»، «يىڭى نۇر» قاتارلىق مەتبۇئاتلاردا ئارقا- ئارقىدىن ئېلان قىلىپ، يېڭى ئۇيغۇر ئەدەبىياتى سېپىگە ئۈمىدلىك ياش كۈچ بولۇپ قوشۇلغان. 1943-يىلى باھاردا، مىللىتارسىت شېڭ شىسەي تەرەققىيپەرۋەرلىك نىقابىنى يىرتىپ تاشلاپ، ئۆزىنى گومىنداڭ قوينىغا ئاتتى. چىن تىيەنچۇ، ماۋزېمىن، لىن جىلۇ قاتارلىق كوممۇنىستلارنى ۋە نۇرغۇن ئىلغار زاتلارنى قولغا ئېلىپ، ئۇلارغا دەھشەتلىك زىيانكەشلىك قىلدى. شۇنىڭ بىلەن ياش شائىرمۇ بۇ بوراندىن ئامان قالماي 1944-يىلى قولغا ئېلىنىپ تۈرمىگە تاشلاندى. ئۇ 1945- يىلىنىڭ باشلىرىدا تۈرمىدىن چىقىپ، نەشرىيات ئورۇنلىرىدا تەھرىرلىك خىزمىتى بىلەن شۇغۇللاندى. 1946-يىلى ئۇنىڭ تۇنجى شېئىرلار توپلىمى «يۈرەك مۇڭلىرى» تاش مەتبەئەدە بېسىلىپ چىقتى. قىزىل ئارمىيە تۈركىستان ھۇدۇدىغا داخىل بولغاندىن كېيىن ئابدۇرېھىم ئۆتكۈر خېلى بىر مەزگىل ئاساسەن تەرجىمانلىق، كلاسسىك ئەدەبىيات تەتقىقاتى ۋە ئوقۇتقۇچىلىق بىلەن، جۈملىدىن چەتئەل تىللىرى ۋە ئەدەبىياتىنى ئۆگىنىش بىلەن شۇغۇللانغا ن بولسىمۇ، ئەدەبىي ئىجادىيەتنى توختىتىپ قويمىغان ئىدى. لېكىن شۇ چاغلاردا ئۇ سولچىللىقنىڭ كاساپىتى بىلەن مەتبۇئات ھوقۇقىدىن مەھرۇم قىلىنىپ، ئەسەرلىرىنى ئېلان قىلىش ئىمكانىيىتىگە ئىگە بولالمىغان. پەقەت ج ك پ 11-نۆۋەتلىك مەركىزى كومىتېتى 3-ئومۇمىي يىغىنىدىن كېيىنلا قايتىدىن ئىجادىيەت ئەركىنلىكىگە ئېرىشكەن. ئۇ قىسقىغىنا بىر نەچچە يىل ئىچىدە «ياخشى» ، «كېرەك بولسا»، «ئۆمۈر ھەققىدە مۇخەممەس»، «بوغدا ئانام»، «مەن ئاق بايراق ئەمەس»، «قەشقەر كېچىسى»، «ئۇلۇغ ئانا ھەققىدە چۆچەك»، «گۈل ۋە ئازغان» قاتارلىق شېئىر، داستان ۋە باللادالارنى، «ئىز»، «ئويغانغان زېمىن» رومانلىرىنى ئېلان قىلىپ، ھازىرقى زامان ئۇيغۇر ئەدەبىياتىدىكى ئورنىنى تولۇق نامايان قىلغان ئىدى. ئەپسۇسكى بۇ ھارماس قەلەمكەش، ئىستىداتلىق يازغۇچى، ئەدەبىياتشۇناس ئالىم ئابدۇرېھىم تىلەشوۋ ئۆتكۈر 1995-يىلى 10-ئايدا كېسەل سەۋەبى بىلەن بىز بىلەن مەڭگۈلۈك خەيرىلەشتى.                </p>
          </div>      
         </div>
      </div>
    </>

  )
}

export default PostContent